artillery/local-test.yaml
config:
  target: 'http://localhost:8080/api/v1'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up

    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load

    - duration: 600
      arrivalRate: 50
      name: Sustained load

  payload:
    path: 'folders.csv'
    fields:
      - 'folderName'

  environments:
    production:
      target: 'https://ansel.4lch4.tech/api/v1'
    testing:
      target: 'https://ansel-dev.4lch4.tech/api/v1'

scenarios:
  # - name: 'Health Check Endpoints'
  #   flow:
  #     - get:
  #         url: '/health/liveness'
  #     - get:
  #         url: '/health/readiness'
  #     - think: 5

  - name: 'Get Images'
    flow:
      - get:
          url: '/get/{{ folderName }}'
      # - get:
      #     url: '/list'
      #     capture:
      #       - json: '$.data'